
## Plan Result




<pre><code>Plan: 1 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_consumption_budget_resource_group.grafana-budget-alert[0]
* Update
  * azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.application_insights.azurerm_application_insights.this
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_consumption_budget_resource_group.grafana-budget-alert[0] will be created
  + resource "azurerm_consumption_budget_resource_group" "grafana-budget-alert" {
      + amount            = 500
      + etag              = (known after apply)
      + id                = (known after apply)
      + name              = "grafana-budget-alert"
      + resource_group_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat"
      + time_grain        = "Monthly"

      + filter {
          + dimension {
              + name     = "ResourceId"
              + operator = "In"
              + values   = [
                  + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat",
                ]
            }
        }

      + notification {
          + contact_emails = []
          + contact_groups = [
              + "DTSSE Alert (aat)",
            ]
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 90
          + threshold_type = "Forecasted"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2023-09-01T00:00:00Z"
        }
    }

  # azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY will be updated in-place
  ~ resource "azurerm_key_vault_secret" "AZURE_APPINSIGHTS_KEY" {
        id                      = "https://dtsse-aat.vault.azure.net/secrets/AppInsightsConnectionString/66a638077327443096af170764a6f8ce"
        name                    = "AppInsightsConnectionString"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                = "DTSSE_Alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Insights/components/dtsse-appinsights-aat"
        name                                  = "dtsse-appinsights-aat"
        tags                                  = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "DTS Software Engineering"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (14 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat|dtsse-aat"
        name                           = "dtsse-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":103,"Program":"tfcmt","SHA1":"","Vars":{}} -->